OpenFOAM_Examples/Quasi_DNS_Dowtherm_Mixed_Conv/exptCases/expt_IDDESCase_bousinesq/Allrun-parallel
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions


runApplication blockMesh -dict system/blockMeshDictIDDES


#- Run parallel
runApplication decomposePar -cellDist
runParallel $(getApplication)
runApplication reconstructPar

#------------------------------------------------------------------------------
